; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	image1 - mode
	image0 - mode
	infrared2 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star0 - direction
	Star4 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared2)
	(supports instrument1 image0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared2)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
	(supports instrument3 image0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 infrared2)
	(supports instrument4 image1)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 infrared2)
	(supports instrument5 image0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star0)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star14)
	(supports instrument8 image0)
	(calibration_target instrument8 Star4)
	(supports instrument9 image0)
	(supports instrument9 infrared2)
	(supports instrument9 image1)
	(calibration_target instrument9 Star4)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon11)
)
(:goal (and
	(pointing satellite2 Planet5)
	(have_image Planet5 infrared2)
	(have_image Star6 infrared2)
	(have_image Star7 image1)
	(have_image Phenomenon8 image1)
	(have_image Star9 image1)
	(have_image Star10 image1)
	(have_image Phenomenon11 image1)
	(have_image Planet12 infrared2)
	(have_image Star13 infrared2)
	(have_image Star14 image0)
	(have_image Star15 image0)
))

)

; plan
1. (turn_to satellite0 star0 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star0)
   goals met: 0 of 12
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 12
3. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 12
4. (turn_to satellite0 star10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star10)
   goals met: 0 of 12
5. (take_image satellite0 star10 instrument1 image1)
   added: (have_image star10 image1)
   goals met: 1 of 12
6. (turn_to satellite0 planet5 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet5)
   goals met: 1 of 12
7. (take_image satellite0 planet5 instrument1 infrared2)
   added: (have_image planet5 infrared2)
   goals met: 2 of 12
8. (turn_to satellite0 planet12 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet12)
   goals met: 2 of 12
9. (take_image satellite0 planet12 instrument1 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 3 of 12
10. (turn_to satellite0 phenomenon8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 12
11. (take_image satellite0 phenomenon8 instrument1 image1)
   added: (have_image phenomenon8 image1)
   goals met: 4 of 12
12. (turn_to satellite0 phenomenon11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 12
13. (take_image satellite0 phenomenon11 instrument1 image1)
   added: (have_image phenomenon11 image1)
   goals met: 5 of 12
14. (turn_to satellite0 star13 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star13)
   goals met: 5 of 12
15. (take_image satellite0 star13 instrument1 infrared2)
   added: (have_image star13 infrared2)
   goals met: 6 of 12
16. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 6 of 12
17. (take_image satellite0 star14 instrument1 image0)
   added: (have_image star14 image0)
   goals met: 7 of 12
18. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 7 of 12
19. (take_image satellite0 star15 instrument1 image0)
   added: (have_image star15 image0)
   goals met: 8 of 12
20. (turn_to satellite0 star6 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star6)
   goals met: 8 of 12
21. (take_image satellite0 star6 instrument1 infrared2)
   added: (have_image star6 infrared2)
   goals met: 9 of 12
22. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 9 of 12
23. (take_image satellite0 star7 instrument1 image1)
   added: (have_image star7 image1)
   goals met: 10 of 12
24. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 10 of 12
25. (take_image satellite0 star9 instrument1 image1)
   added: (have_image star9 image1)
   goals met: 11 of 12
26. (turn_to satellite2 planet5 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 planet5)
   goals met: 12 of 12
